🚀&nbsp; env0 had composed a PR Plan for environment [deva / FrontEnd Servers (EC2)-37746 ](https://app.env0.com/p/c0f2f64b-a98e-4f02-a094-dfa4d8e3edd0/environments/389450d7-855e-498e-b7bc-080b37a995ee?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:


  # module.acme-ec2.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
!       ami                                  = "ami-070686bd03233cfa1" -> "ami-0a15226b1f7f23580" # forces replacement
!       arn                                  = "arn:aws:ec2:us-west-2:244172364962:instance/i-0b46d59e8354a7f04" -> (known after apply)
!       availability_zone                    = "us-west-2b" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 2 -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
!       id                                   = "i-0b46d59e8354a7f04" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       instance_type                        = "t3a.medium" -> "t3a.micro"
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
+       key_name                             = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       primary_network_interface_id         = "eni-0bd89af263c63c9fc" -> (known after apply)
!       private_dns                          = "ip-10-0-3-33.us-west-2.compute.internal" -> (known after apply)
!       private_ip                           = "10.0.3.33" -> (known after apply)
+       public_dns                           = (known after apply)
!       public_ip                            = "54.191.205.29" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
!       tags                                 = {
!           "Demo"      = "Oct 22" -> "Nov 5"
            "Name"      = "acme-frontend"
            "Owner"     = "acme demo org"
            "Terraform" = "true"
!           "Test"      = "new tag" -> "new taga"
        }
!       tags_all                             = {
!           "Demo"      = "Oct 22" -> "Nov 5"
!           "Test"      = "new tag" -> "new taga"
            # (3 unchanged elements hidden)
        }
!       vpc_security_group_ids               = [
-           "sg-08fdaac30443c7649",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

!       ebs_block_device {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       enclave_options {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       ephemeral_block_device {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       metadata_options {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       network_interface {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

!       root_block_device {
+           ami                                  = (known after apply)
+           arn                                  = (known after apply)
+           associate_public_ip_address          = (known after apply)
+           availability_zone                    = (known after apply)
+           cpu_core_count                       = (known after apply)
+           cpu_threads_per_core                 = (known after apply)
+           disable_api_termination              = (known after apply)
+           ebs_optimized                        = (known after apply)
+           get_password_data                    = (known after apply)
+           hibernation                          = (known after apply)
+           host_id                              = (known after apply)
+           iam_instance_profile                 = (known after apply)
+           id                                   = (known after apply)
+           instance_initiated_shutdown_behavior = (known after apply)
+           instance_state                       = (known after apply)
+           instance_type                        = (known after apply)
+           ipv6_address_count                   = (known after apply)
+           ipv6_addresses                       = (known after apply)
+           key_name                             = (known after apply)
+           monitoring                           = (known after apply)
+           outpost_arn                          = (known after apply)
+           password_data                        = (known after apply)
+           placement_group                      = (known after apply)
+           primary_network_interface_id         = (known after apply)
+           private_dns                          = (known after apply)
+           private_ip                           = (known after apply)
+           public_dns                           = (known after apply)
+           public_ip                            = (known after apply)
+           secondary_private_ips                = (known after apply)
+           security_groups                      = (known after apply)
+           source_dest_check                    = (known after apply)
+           subnet_id                            = (known after apply)
+           tags                                 = (known after apply)
+           tags_all                             = (known after apply)
+           tenancy                              = (known after apply)
+           user_data                            = (known after apply)
+           user_data_base64                     = (known after apply)
+           volume_tags                          = (known after apply)
+           vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   instances  = [
-       "i-0b46d59e8354a7f04",
+       (known after apply),
    ]
!   private_ip = [
-       "10.0.3.33",
+       (known after apply),
    ]
!   public_ip  = [
-       "54.191.205.29",
+       (known after apply),
    ]
```
</details>


```
Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  -$20 ($28 → $8)
Percent: -72%
```
<details>
<summary>Cost Estimation Details</summary>

```diff
Key: * usage cost, ~ changed, + added, - removed

──────────────────────────────────
Project: env0/acme-demo/.env0workdir/env0_tf_plan.json

! module.acme-ec2.aws_instance.this[0]
  -$20 ($28 → $8)

!     Instance usage (Linux/UNIX, on-demand, t3a.medium → t3a.micro)
      -$21 ($27 → $7)

!     root_block_device
    
!         Storage (magnetic) → (general purpose SSD, gp2)
          +$0.40 ($0.40 → $0.80)
    
-         I/O requests
          Monthly cost depends on usage
            -$0.05 per 1M request

Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  -$20 ($28 → $8)
Percent: -72%

──────────────────────────────────
Key: * usage cost, ~ changed, + added, - removed

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

1 cloud resource was detected:
∙ 1 was estimated

Infracost estimate: Monthly estimate decreased by $20 ↓
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━┓
┃ Changed project                                    ┃ Baseline cost ┃ Usage cost* ┃ Total change ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━┫
┃ env0/acme-demo/.env0workdir/env0_tf_plan.json      ┃          -$20 ┃           - ┃  -$20 (-72%) ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━┛
```
</details>



[Full PR Plan logs on env0](https://app.env0.com/p/c0f2f64b-a98e-4f02-a094-dfa4d8e3edd0/environments/389450d7-855e-498e-b7bc-080b37a995ee/deployments/5c18cb5d-f4d2-4c7f-8512-193a1eee7310?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92)

[![env0-ai-summary-banner](https://app.env0.com/images/vcs-comment-ai-summary-banner.png)](https://app.env0.com/p/c0f2f64b-a98e-4f02-a094-dfa4d8e3edd0/environments/389450d7-855e-498e-b7bc-080b37a995ee/deployments/5c18cb5d-f4d2-4c7f-8512-193a1eee7310?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92&ai-analyzer=plan-summary)